In [8]:
import pandas as pd
x=["we","are","here"]
print(pd.Series(x,index=['a','b','c']))

a      we
b     are
c    here
dtype: object

In [9]:
import pandas as pd
date_series = pd.date_range(start = '05-01-2021', end = '05-12-2021')

print(date_series)

DatetimeIndex(['2021-05-01', '2021-05-02', '2021-05-03', '2021-05-04',
               '2021-05-05', '2021-05-06', '2021-05-07', '2021-05-08',
               '2021-05-09', '2021-05-10', '2021-05-11', '2021-05-12'],
              dtype='datetime64[ns]', freq='D')

In [10]:
import pandas as pd
details = {
	'Name' : ['Ankit', 'Aishwarya', 'Shaurya', 'Shivangi'],
	'Age' : [23, 21, 22, 21],
	'University' : ['BHU', 'JNU', 'DU', 'BHU'],
}
df = pd.DataFrame(details, index = ['a', 'b', 'c', 'd'])
print(df)

        Name  Age University
a      Ankit   23        BHU
b  Aishwarya   21        JNU
c    Shaurya   22         DU
d   Shivangi   21        BHU

In [12]:
import pandas as pd

data = [['New York Yankees', 'Acevedo Juan', 900000, 'Pitcher'], 
        ['New York Yankees', 'Anderson Jason', 300000, 'Pitcher'], 
        ['New York Yankees', 'Clemens Roger', 10100000, 'Pitcher'], 
        ['New York Yankees', 'Contreras Jose', 5500000, 'Pitcher']]
pd.DataFrame.from_records(data)

                  0               1         2        3
0  New York Yankees    Acevedo Juan    900000  Pitcher
1  New York Yankees  Anderson Jason    300000  Pitcher
2  New York Yankees   Clemens Roger  10100000  Pitcher
3  New York Yankees  Contreras Jose   5500000  Pitcher

In [14]:
import pandas as pd
x=pd.read_csv("data.csv")
print(x.head())

      name   mark
0  jackson     40
1     mike     35
2    david     50

In [24]:
import numpy as np
import pandas as pd
df = pd.DataFrame({'Name': ['Raj', 'Akhil', 'Sonum', 'Tilak', 'Divya', 'Megha'],
				'Age': [20, 22, 21, 19, 17, 23],
				'Rank': [1, np.nan, 8, 9, 4, np.nan]})
df

    Name  Age  Rank
0    Raj   20   1.0
1  Akhil   22   NaN
2  Sonum   21   8.0
3  Tilak   19   9.0
4  Divya   17   4.0
5  Megha   23   NaN

In [23]:
print('SORTED DATAFRAME')
df.sort_values(by=['Age'], ascending=False)

SORTED DATAFRAME

    Name  Age  Rank
5  Megha   23   NaN
1  Akhil   22   NaN
2  Sonum   21   8.0
0    Raj   20   1.0
3  Tilak   19   9.0
4  Divya   17   4.0